import React from 'react';
import { View } from 'react-native';
import Svg, { Path } from 'react-native-svg';

const AddButton = ({ size = 55 }) => {
    return (

        <View
            style={{ width: size, height: size }}
            className="justify-center items-center"
        >
            {/* 2. SVG ไอคอนบวก (เอาโค้ด SVG ของคุณมาแปะแทนตรง Path ได้เลย) */}
            <Svg width={size} height={size} viewBox="0 0 55 55">
                <Path
                    d="M27.5 0C12.3105 0 0 12.3105 0 27.5C0 42.6895 12.3105 55 27.5 55C42.6895 55 55 42.6895 55 27.5C55 12.3105 42.6895 0 27.5 0ZM43.5381 29.7881C43.5381 31.0557 42.5176 32.0762 41.25 32.0762H32.0869V41.25C32.0869 42.5176 31.0664 43.5381 29.7988 43.5381H25.2119C23.9443 43.5381 22.9238 42.5068 22.9238 41.25V32.0869H13.75C12.4824 32.0869 11.4619 31.0557 11.4619 29.7988V25.2119C11.4619 23.9443 12.4824 22.9238 13.75 22.9238H22.9131V13.75C22.9131 12.4824 23.9336 11.4619 25.2012 11.4619H29.7881C31.0557 11.4619 32.0762 12.4932 32.0762 13.75V22.9131H41.25C42.5176 22.9131 43.5381 23.9443 43.5381 25.2012V29.7881Z"
                    fill="#FFFFFF"
                />
            </Svg>
        </View>
    );
};

export default AddButton;